[net]
subdivisions=1
batch=32

height=28
width=28
channels=1

max_batches=3000
time_steps=1

learning_rate=0.0001

policy=constant

[connected]
output=512
activation=leaky

[connected]
output=10
activation=leaky

[softmax]
groups=1
