[net]
subdivisions=1
batch=4

height=28
width=28
channels=1

max_batches=10000
time_steps=1

learning_rate=0.001

policy=constant

[convolutional]
batch_normalize=1
filters=16
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=4
stride=4

[convolutional]
batch_normalize=1
filters=16
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=4
stride=4

[connected]
output=10
activation=leaky

[softmax]
groups=1